Myrottenpotatoes/app/controllers/application_controller.rb

  def set_current_user

    @current_user ||= Moviegoer.find_by(id: session[:user_id])
    begin
    @moviegoer_reviews = @current_user.reviews.find_by(movie_id: params[:movie_id])
---
SELECT "moviegoers".* FROM "moviegoers" WHERE "moviegoers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."moviegoer_id" = ? AND "reviews"."movie_id" = ? LIMIT ?  [["moviegoer_id", 1], ["movie_id", 1], ["LIMIT", 1]]