Myrottenpotatoes/app/controllers/movies_controller.rb

    def index
      @movies = Movie.all.sort_by { |name| name.title}
---
SELECT "movies".* FROM "movies"

    def show
        id = params[:id]
        begin
            @movie = Movie.find(id)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        params.require(:movie)
        permitted = params[:movie].permit(:title,:rating,:release_date,:description)
        @movie = Movie.new(permitted)
        if @movie.save
---
INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Anda"], ["rating", "G"], ["description", "anda"], ["release_date", "2021-09-30 00:00:00"], ["created_at", "2021-09-30 14:52:52.422788"], ["updated_at", "2021-09-30 14:52:52.422788"]]