Myrottenpotatoes/app/controllers/reviews_controller.rb

    def has_moviegoer_and_movie
      unless @current_user
        flash[:warning] = 'You must be logged in to create a review.'
        redirect_to movies_path
      end

      unless (@movie = Movie.find(params[:movie_id]))
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def index
      @movie = Movie.find params[:movie_id]
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        permitted = params[:review].permit(:potatoes, :comments, :moviegoer_id, :movie_id)
        @review = @movie.reviews.build(permitted)
        @current_user.reviews << @review
---
INSERT INTO "reviews" ("potatoes", "comments", "moviegoer_id", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["potatoes", 3], ["comments", "anda"], ["moviegoer_id", 1], ["movie_id", 1], ["created_at", "2021-09-30 14:53:06.325582"], ["updated_at", "2021-09-30 14:53:06.325582"]]

     def edit
		    @movie = Movie.find params[:movie_id]
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

     def update
		    @movie = Movie.find(params[:movie_id])
		    permitted = params[:review].permit(:potatoes, :comments, :moviegoer_id, :movie_id)
		    @review = @movie.reviews.update(permitted)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "reviews" SET "potatoes" = ?, "comments" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["potatoes", 5], ["comments", "kk"], ["updated_at", "2021-09-30 16:18:05.944855"], ["id", 4]]

    def show
        id = params[:movie_id]
        begin
            @movie = Movie.find(id)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]