Myrottenpotatoes/app/controllers/sessions_controller.rb

    def create
      user=Moviegoer.where(:provider => auth["provider"], :uid => auth["uid"]).first ||
        Moviegoer.create_with_omniauth(auth)
---
INSERT INTO "moviegoers" ("name", "provider", "uid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "white clear"], ["provider", "google_oauth2"], ["uid", "102523006128483568056"], ["created_at", "2021-09-30 14:52:41.661448"], ["updated_at", "2021-09-30 14:52:41.661448"]]
SELECT "moviegoers".* FROM "moviegoers" WHERE "moviegoers"."provider" = ? AND "moviegoers"."uid" = ? ORDER BY "moviegoers"."id" ASC LIMIT ?  [["provider", "google_oauth2"], ["uid", "112167459517191858276"], ["LIMIT", 1]]