Myrottenpotatoes/app/models/moviegoer.rb

INSERT INTO "moviegoers" ("name", "provider", "uid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "white clear"], ["provider", "google_oauth2"], ["uid", "102523006128483568056"], ["created_at", "2021-09-30 14:52:41.661448"], ["updated_at", "2021-09-30 14:52:41.661448"]]
---
  def self.create_with_omniauth(auth)
    Moviegoer.create!(
      :provider => auth["provider"],
      :uid => auth["uid"],
      :name => auth["info"]["name"])